<div id="left-side">
	<div class="container">
		<div class="block">
			<div class="block-title">
				<h1>הגדרות האתר</h1>
			</div>
			<div class="block-inner">
				<form method="post">
					<div class="row">
						<div class="input-field">
							<label for="title_web" class="active">כותרת האתר</label>
							<input type="text" name="title_web" value="<?= $Settings['title'] ?>"/>
						</div>
						<div class="row-remark">
							<svg xmlns="http://www.w3.org/2000/svg" version="1.1" x="0" y="0" viewBox="0 0 496.2 496.2" xml:space="preserve"><style>.s0{fill:#FFF;}</style><path d="M496.2 248.1c0-137-111.1-248.1-248.1-248.1C111.1 0 0 111.1 0 248.1c0 137 111.1 248.1 248.1 248.1C385.1 496.2 496.2 385.1 496.2 248.1z" fill="#25B7D3"/><path d="M315.2 359.6c-1.4-2-4-2.8-6.3-1.7 -24.6 11.6-52.5 23.9-58 25 -0.1-0.1-0.4-0.3-0.6-0.7 -0.7-1-1.1-2.3-1.1-4 0-13.9 10.5-56.2 31.2-125.7 17.5-58.4 19.5-70.5 19.5-74.5 0-6.2-2.4-11.4-6.9-15.1 -4.3-3.5-10.2-5.3-17.7-5.3 -12.5 0-26.9 4.7-44.1 14.5 -16.7 9.4-35.4 25.4-55.4 47.5 -1.6 1.7-1.7 4.3-0.4 6.2 1.3 1.9 3.8 2.6 6 1.8 7-2.9 42.4-17.4 47.6-20.6 4.2-2.6 7.9-4 10.9-4 0.1 0 0.2 0 0.3 0 0 0.2 0.1 0.5 0.1 0.9 0 3-0.6 6.7-1.9 10.7 -30.1 97.6-44.8 157.5-44.8 183 0 9 2.5 16.2 7.4 21.5 5 5.4 11.8 8.1 20.1 8.1 8.9 0 19.7-3.7 33.1-11.4 12.9-7.4 32.7-23.7 60.4-49.7C316.3 364.3 316.6 361.6 315.2 359.6zM314.3 76.7c-4.9-5-11.2-7.6-18.7-7.6 -9.3 0-17.5 3.7-24.2 11 -6.6 7.2-9.9 15.9-9.9 26.1 0 8 2.5 14.7 7.3 19.8 4.9 5.2 11.1 7.8 18.5 7.8 9 0 17-3.9 24-11.6 6.9-7.6 10.4-16.4 10.4-26.4C321.6 88.1 319.2 81.7 314.3 76.7z" fill="#FFF"/></svg>								
							<p>תופיע בתור כותרת האתר במנועי חיפוש ודפדפני אינטרנט.</p>
						</div>
					</div>
					<div class="clear"></div>
					<div class="row">
						<div class="input-field">
							<label for="keywords" class="active">מילות קישור (Keyworks)</label>
							<input type="text" name="keywords" value="<?= $Settings['words'] ?>"/>
						</div>
						<div class="row-remark">
							<svg xmlns="http://www.w3.org/2000/svg" version="1.1" x="0" y="0" viewBox="0 0 496.2 496.2" xml:space="preserve"><style>.s0{fill:#FFF;}</style><path d="M496.2 248.1c0-137-111.1-248.1-248.1-248.1C111.1 0 0 111.1 0 248.1c0 137 111.1 248.1 248.1 248.1C385.1 496.2 496.2 385.1 496.2 248.1z" fill="#25B7D3"/><path d="M315.2 359.6c-1.4-2-4-2.8-6.3-1.7 -24.6 11.6-52.5 23.9-58 25 -0.1-0.1-0.4-0.3-0.6-0.7 -0.7-1-1.1-2.3-1.1-4 0-13.9 10.5-56.2 31.2-125.7 17.5-58.4 19.5-70.5 19.5-74.5 0-6.2-2.4-11.4-6.9-15.1 -4.3-3.5-10.2-5.3-17.7-5.3 -12.5 0-26.9 4.7-44.1 14.5 -16.7 9.4-35.4 25.4-55.4 47.5 -1.6 1.7-1.7 4.3-0.4 6.2 1.3 1.9 3.8 2.6 6 1.8 7-2.9 42.4-17.4 47.6-20.6 4.2-2.6 7.9-4 10.9-4 0.1 0 0.2 0 0.3 0 0 0.2 0.1 0.5 0.1 0.9 0 3-0.6 6.7-1.9 10.7 -30.1 97.6-44.8 157.5-44.8 183 0 9 2.5 16.2 7.4 21.5 5 5.4 11.8 8.1 20.1 8.1 8.9 0 19.7-3.7 33.1-11.4 12.9-7.4 32.7-23.7 60.4-49.7C316.3 364.3 316.6 361.6 315.2 359.6zM314.3 76.7c-4.9-5-11.2-7.6-18.7-7.6 -9.3 0-17.5 3.7-24.2 11 -6.6 7.2-9.9 15.9-9.9 26.1 0 8 2.5 14.7 7.3 19.8 4.9 5.2 11.1 7.8 18.5 7.8 9 0 17-3.9 24-11.6 6.9-7.6 10.4-16.4 10.4-26.4C321.6 88.1 319.2 81.7 314.3 76.7z" fill="#FFF"/></svg>								
							<p>עוזר לקדם את האתר במילות חיפוש, יש להפריד כל מילה בפסיק</p>
						</div>
					</div>
					<div class="clear"></div>
					<div class="row">
						<div class="input-field">
							<label for="desc" class="active">תיאור האתר</label>
							<input type="text" name="desc" value="<?= $Settings['description'] ?>"/>
						</div>
						<div class="row-remark">
							<svg xmlns="http://www.w3.org/2000/svg" version="1.1" x="0" y="0" viewBox="0 0 496.2 496.2" xml:space="preserve"><style>.s0{fill:#FFF;}</style><path d="M496.2 248.1c0-137-111.1-248.1-248.1-248.1C111.1 0 0 111.1 0 248.1c0 137 111.1 248.1 248.1 248.1C385.1 496.2 496.2 385.1 496.2 248.1z" fill="#25B7D3"/><path d="M315.2 359.6c-1.4-2-4-2.8-6.3-1.7 -24.6 11.6-52.5 23.9-58 25 -0.1-0.1-0.4-0.3-0.6-0.7 -0.7-1-1.1-2.3-1.1-4 0-13.9 10.5-56.2 31.2-125.7 17.5-58.4 19.5-70.5 19.5-74.5 0-6.2-2.4-11.4-6.9-15.1 -4.3-3.5-10.2-5.3-17.7-5.3 -12.5 0-26.9 4.7-44.1 14.5 -16.7 9.4-35.4 25.4-55.4 47.5 -1.6 1.7-1.7 4.3-0.4 6.2 1.3 1.9 3.8 2.6 6 1.8 7-2.9 42.4-17.4 47.6-20.6 4.2-2.6 7.9-4 10.9-4 0.1 0 0.2 0 0.3 0 0 0.2 0.1 0.5 0.1 0.9 0 3-0.6 6.7-1.9 10.7 -30.1 97.6-44.8 157.5-44.8 183 0 9 2.5 16.2 7.4 21.5 5 5.4 11.8 8.1 20.1 8.1 8.9 0 19.7-3.7 33.1-11.4 12.9-7.4 32.7-23.7 60.4-49.7C316.3 364.3 316.6 361.6 315.2 359.6zM314.3 76.7c-4.9-5-11.2-7.6-18.7-7.6 -9.3 0-17.5 3.7-24.2 11 -6.6 7.2-9.9 15.9-9.9 26.1 0 8 2.5 14.7 7.3 19.8 4.9 5.2 11.1 7.8 18.5 7.8 9 0 17-3.9 24-11.6 6.9-7.6 10.4-16.4 10.4-26.4C321.6 88.1 319.2 81.7 314.3 76.7z" fill="#FFF"/></svg>								
							<p>עוזר לאתר להביא לקוחות/גולשים פוטנציאלים</p>
						</div>
					</div>
					<div class="row">
						<div class="input-field">
							<input type="submit" name="submit1" value="החל שינויים" class="button_tickets">
						</div>
					</div>
				</form>
				<?php
				
					if (isset($_POST['submit1']))
					{
						if (empty($_POST['title_web']) || empty($_POST['keywords']) || empty($_POST['desc']))
						{
							echo '
								<div class="row">
									<div class="input-field">
										<div class="notice error"><p>שגיאה: אחד מהשדות אינם תקינים.</p></div>
									</div>
								</div>
							';
						}
						else
						{
							$title_web = secur($_POST['title_web'], "string");
							$keywords = secur($_POST['keywords'], "string");
							$desc = secur($_POST['desc'], "string");
							$update = $mysqli->query("UPDATE `".PREFIX."_settings` SET `title`='{$title_web}', `words`='{$keywords}', `description`='{$desc}'");
							refreshPage("הפעולה בוצעה בהצלחה","הגדרות האתר השתנו בהתאם לבקשתך!");

							
						}
					}
				?>
			</div>
		</div>
		<div class="block">
			<div class="block-title">
				<h1>מצב האתר</h1>
			</div>
			
			<div class="block-inner">
				<form method="post">
					<div class="row">
						מצב האתר: <br />
						<label class="switch">
						  <input type="checkbox" name="sitestatus" <?php if ($Settings['status'] == 1) echo "checked"; ?>  />
						  <span class="slider round"></span>
						</label>
						<div class="row-remark">
							<svg xmlns="http://www.w3.org/2000/svg" version="1.1" x="0" y="0" viewBox="0 0 496.2 496.2" xml:space="preserve"><style>.s0{fill:#FFF;}</style><path d="M496.2 248.1c0-137-111.1-248.1-248.1-248.1C111.1 0 0 111.1 0 248.1c0 137 111.1 248.1 248.1 248.1C385.1 496.2 496.2 385.1 496.2 248.1z" fill="#25B7D3"/><path d="M315.2 359.6c-1.4-2-4-2.8-6.3-1.7 -24.6 11.6-52.5 23.9-58 25 -0.1-0.1-0.4-0.3-0.6-0.7 -0.7-1-1.1-2.3-1.1-4 0-13.9 10.5-56.2 31.2-125.7 17.5-58.4 19.5-70.5 19.5-74.5 0-6.2-2.4-11.4-6.9-15.1 -4.3-3.5-10.2-5.3-17.7-5.3 -12.5 0-26.9 4.7-44.1 14.5 -16.7 9.4-35.4 25.4-55.4 47.5 -1.6 1.7-1.7 4.3-0.4 6.2 1.3 1.9 3.8 2.6 6 1.8 7-2.9 42.4-17.4 47.6-20.6 4.2-2.6 7.9-4 10.9-4 0.1 0 0.2 0 0.3 0 0 0.2 0.1 0.5 0.1 0.9 0 3-0.6 6.7-1.9 10.7 -30.1 97.6-44.8 157.5-44.8 183 0 9 2.5 16.2 7.4 21.5 5 5.4 11.8 8.1 20.1 8.1 8.9 0 19.7-3.7 33.1-11.4 12.9-7.4 32.7-23.7 60.4-49.7C316.3 364.3 316.6 361.6 315.2 359.6zM314.3 76.7c-4.9-5-11.2-7.6-18.7-7.6 -9.3 0-17.5 3.7-24.2 11 -6.6 7.2-9.9 15.9-9.9 26.1 0 8 2.5 14.7 7.3 19.8 4.9 5.2 11.1 7.8 18.5 7.8 9 0 17-3.9 24-11.6 6.9-7.6 10.4-16.4 10.4-26.4C321.6 88.1 319.2 81.7 314.3 76.7z" fill="#FFF"/></svg>								
							<p>שולט בנעילת האתר, במידה והאתר "נעול" הוא יציג הודעת שגיאה 404.</p>
						</div>
					</div>

					<div class="row">
						<div class="input-field">
							<input type="submit" name="submit2" value="החל שינויים" class="button_tickets">
						</div>
					</div>
				</form>
				<?php
					if (isset($_POST['submit2']))
					{
						
						if (isset($_POST['sitestatus']))
						{
							$status = 1;
						}
						else
						{
							$status = 0;
						}
						
						$update = $mysqli->query("UPDATE `".PREFIX."_settings` SET `status`='{$status}'");
						refreshPage("הפעולה בוצעה בהצלחה","מצב האתר השתנה בהתאם לבקשתך!");
					}
				?>
			</div>
		</div>
		<div class="block">
			<div class="block-title">
				<h1>פרטי יצירת קשר</h1>
			</div>
			<div class="block-inner">
				<form method="post">
					<div class="row">
						<div class="input-field">
							<label for="title_web" class="active">מספר טלפון</label>
							<input type="text" name="phonenumber" value="<?= $Settings['phonenumber'] ?>"/>
						</div>
						<div class="row-remark">
							<svg xmlns="http://www.w3.org/2000/svg" version="1.1" x="0" y="0" viewBox="0 0 496.2 496.2" xml:space="preserve"><style>.s0{fill:#FFF;}</style><path d="M496.2 248.1c0-137-111.1-248.1-248.1-248.1C111.1 0 0 111.1 0 248.1c0 137 111.1 248.1 248.1 248.1C385.1 496.2 496.2 385.1 496.2 248.1z" fill="#25B7D3"/><path d="M315.2 359.6c-1.4-2-4-2.8-6.3-1.7 -24.6 11.6-52.5 23.9-58 25 -0.1-0.1-0.4-0.3-0.6-0.7 -0.7-1-1.1-2.3-1.1-4 0-13.9 10.5-56.2 31.2-125.7 17.5-58.4 19.5-70.5 19.5-74.5 0-6.2-2.4-11.4-6.9-15.1 -4.3-3.5-10.2-5.3-17.7-5.3 -12.5 0-26.9 4.7-44.1 14.5 -16.7 9.4-35.4 25.4-55.4 47.5 -1.6 1.7-1.7 4.3-0.4 6.2 1.3 1.9 3.8 2.6 6 1.8 7-2.9 42.4-17.4 47.6-20.6 4.2-2.6 7.9-4 10.9-4 0.1 0 0.2 0 0.3 0 0 0.2 0.1 0.5 0.1 0.9 0 3-0.6 6.7-1.9 10.7 -30.1 97.6-44.8 157.5-44.8 183 0 9 2.5 16.2 7.4 21.5 5 5.4 11.8 8.1 20.1 8.1 8.9 0 19.7-3.7 33.1-11.4 12.9-7.4 32.7-23.7 60.4-49.7C316.3 364.3 316.6 361.6 315.2 359.6zM314.3 76.7c-4.9-5-11.2-7.6-18.7-7.6 -9.3 0-17.5 3.7-24.2 11 -6.6 7.2-9.9 15.9-9.9 26.1 0 8 2.5 14.7 7.3 19.8 4.9 5.2 11.1 7.8 18.5 7.8 9 0 17-3.9 24-11.6 6.9-7.6 10.4-16.4 10.4-26.4C321.6 88.1 319.2 81.7 314.3 76.7z" fill="#FFF"/></svg>								
							<p>יוצג בכל חלקי האתר</p>
						</div>
					</div>
					<div class="clear"></div>
					<div class="row">
						<div class="input-field">
							<label for="keywords" class="active">כתובת אימייל</label>
							<input type="text" name="email" value="<?= $Settings['email'] ?>"/>
						</div>
						<div class="row-remark">
							<svg xmlns="http://www.w3.org/2000/svg" version="1.1" x="0" y="0" viewBox="0 0 496.2 496.2" xml:space="preserve"><style>.s0{fill:#FFF;}</style><path d="M496.2 248.1c0-137-111.1-248.1-248.1-248.1C111.1 0 0 111.1 0 248.1c0 137 111.1 248.1 248.1 248.1C385.1 496.2 496.2 385.1 496.2 248.1z" fill="#25B7D3"/><path d="M315.2 359.6c-1.4-2-4-2.8-6.3-1.7 -24.6 11.6-52.5 23.9-58 25 -0.1-0.1-0.4-0.3-0.6-0.7 -0.7-1-1.1-2.3-1.1-4 0-13.9 10.5-56.2 31.2-125.7 17.5-58.4 19.5-70.5 19.5-74.5 0-6.2-2.4-11.4-6.9-15.1 -4.3-3.5-10.2-5.3-17.7-5.3 -12.5 0-26.9 4.7-44.1 14.5 -16.7 9.4-35.4 25.4-55.4 47.5 -1.6 1.7-1.7 4.3-0.4 6.2 1.3 1.9 3.8 2.6 6 1.8 7-2.9 42.4-17.4 47.6-20.6 4.2-2.6 7.9-4 10.9-4 0.1 0 0.2 0 0.3 0 0 0.2 0.1 0.5 0.1 0.9 0 3-0.6 6.7-1.9 10.7 -30.1 97.6-44.8 157.5-44.8 183 0 9 2.5 16.2 7.4 21.5 5 5.4 11.8 8.1 20.1 8.1 8.9 0 19.7-3.7 33.1-11.4 12.9-7.4 32.7-23.7 60.4-49.7C316.3 364.3 316.6 361.6 315.2 359.6zM314.3 76.7c-4.9-5-11.2-7.6-18.7-7.6 -9.3 0-17.5 3.7-24.2 11 -6.6 7.2-9.9 15.9-9.9 26.1 0 8 2.5 14.7 7.3 19.8 4.9 5.2 11.1 7.8 18.5 7.8 9 0 17-3.9 24-11.6 6.9-7.6 10.4-16.4 10.4-26.4C321.6 88.1 319.2 81.7 314.3 76.7z" fill="#FFF"/></svg>								
							<p>יוצג בכל האתר</p>
						</div>
					</div>
					<div class="clear"></div>
					<div class="row">
						<div class="input-field">
							<label for="keywords" class="active">כתובת המשרד</label>
							<input type="text" name="address" value="<?= $Settings['address'] ?>"/>
						</div>
						<div class="row-remark">
							<svg xmlns="http://www.w3.org/2000/svg" version="1.1" x="0" y="0" viewBox="0 0 496.2 496.2" xml:space="preserve"><style>.s0{fill:#FFF;}</style><path d="M496.2 248.1c0-137-111.1-248.1-248.1-248.1C111.1 0 0 111.1 0 248.1c0 137 111.1 248.1 248.1 248.1C385.1 496.2 496.2 385.1 496.2 248.1z" fill="#25B7D3"/><path d="M315.2 359.6c-1.4-2-4-2.8-6.3-1.7 -24.6 11.6-52.5 23.9-58 25 -0.1-0.1-0.4-0.3-0.6-0.7 -0.7-1-1.1-2.3-1.1-4 0-13.9 10.5-56.2 31.2-125.7 17.5-58.4 19.5-70.5 19.5-74.5 0-6.2-2.4-11.4-6.9-15.1 -4.3-3.5-10.2-5.3-17.7-5.3 -12.5 0-26.9 4.7-44.1 14.5 -16.7 9.4-35.4 25.4-55.4 47.5 -1.6 1.7-1.7 4.3-0.4 6.2 1.3 1.9 3.8 2.6 6 1.8 7-2.9 42.4-17.4 47.6-20.6 4.2-2.6 7.9-4 10.9-4 0.1 0 0.2 0 0.3 0 0 0.2 0.1 0.5 0.1 0.9 0 3-0.6 6.7-1.9 10.7 -30.1 97.6-44.8 157.5-44.8 183 0 9 2.5 16.2 7.4 21.5 5 5.4 11.8 8.1 20.1 8.1 8.9 0 19.7-3.7 33.1-11.4 12.9-7.4 32.7-23.7 60.4-49.7C316.3 364.3 316.6 361.6 315.2 359.6zM314.3 76.7c-4.9-5-11.2-7.6-18.7-7.6 -9.3 0-17.5 3.7-24.2 11 -6.6 7.2-9.9 15.9-9.9 26.1 0 8 2.5 14.7 7.3 19.8 4.9 5.2 11.1 7.8 18.5 7.8 9 0 17-3.9 24-11.6 6.9-7.6 10.4-16.4 10.4-26.4C321.6 88.1 319.2 81.7 314.3 76.7z" fill="#FFF"/></svg>								
							<p>יוצג בכל האתר</p>
						</div>
					</div>
					<div class="clear"></div>
					
					<div class="row">
						<div class="input-field">
							<input type="submit" name="submit3" value="החל שינויים" class="button_tickets">
						</div>
					</div>
				</form>
				<?php
					if (isset($_POST['submit3']))
					{
						$address = secur($_POST['address'],"string");
						$email = secur($_POST['email'],"string");
						$phonenumber = secur($_POST['phonenumber'],"string");
						if (empty($phonenumber) || empty($email) || empty($address))
						{
							echo '
								<div class="row">
									<div class="input-field">
										<div class="notice error"><p>שגיאה: אחד מהשדות אינם תקינים.</p></div>
									</div>
								</div>
							';
						}
						else
						{
							
							$update = $mysqli->query("UPDATE `".PREFIX."_settings` SET `phonenumber`='{$phonenumber}', `address`='{$address}', `email`='{$email}'");
							refreshPage("הפעולה בוצעה בהצלחה","פרטי יצירת הקשר השתנו בהתאם לבקשתך!");
						}
					}
				?>
				
			</div>
		</div>
	</div>
</div>